sdaiIsSDAISubtypeOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether a specified SDAI data type is a subtype of another SDAI data type (supertype).
\param subtype   [in] An entity that represents the SDAI data type to be checked.
\param supertype [in] An entity that represents the SDAI supertype.
\returns sdaiTRUE if the specified SDAI data type is a subtype of the specified supertype; otherwise, the function returns sdaiFALSE.